In [54]:
import pandas as pd

# series

In [55]:
data = [1,2,3,4,5]

In [56]:
s = pd.Series(data)

In [57]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [58]:
index = ['linha' + str(i) for i in range(5)]

In [59]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [60]:
s = pd.Series(data = data, index= index)

In [61]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [62]:
data = {'linha' + str(i) : i + 1 for i in range(5)}

In [63]:
data

{'linha0': 1, 'linha1': 2, 'linha2': 3, 'linha3': 4, 'linha4': 5}

In [64]:
s = pd.Series(data)

In [65]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [66]:
s1 = s + 2

In [67]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [68]:
s2 = s + s1

In [69]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

In [70]:
data = [[1,2,3], [4, 5, 6], [7,8,9]]

In [71]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [72]:
df1 = pd.DataFrame(data = data)

In [73]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [74]:
index = ['linha' + str(i) for i in range(3)]

In [75]:
index

['linha0', 'linha1', 'linha2']

In [76]:
df1 = pd. DataFrame(data = data, index = index)

In [77]:
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [78]:
columns = ['coluna' + str(i) for i in range(3)]

In [79]:
columns

['coluna0', 'coluna1', 'coluna2']

In [80]:
df1 = pd. DataFrame(data = data, index = index, columns = columns)

In [81]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [82]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [83]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [84]:
df2 = pd.DataFrame(data)

In [85]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [86]:
data = [(1,2,3), (4, 5, 6), (7,8,9)]

In [87]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [88]:
df3 =  pd. DataFrame(data = data, index = index, columns = columns)

In [89]:
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [90]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [91]:
df1[df1 > 0] = 'A'

In [92]:
df1

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A

In [93]:
df2[df2 > 0] = 'B'

In [94]:
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [95]:
df3 [df3 > 0] = 'C'

In [96]:
df3

       coluna0 coluna1 coluna2
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [97]:
df4 = pd.concat([df1, df2, df3])

In [98]:
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2
linha0       A       A       A     NaN     NaN     NaN
linha1       A       A       A     NaN     NaN     NaN
linha2       A       A       A     NaN     NaN     NaN
Linha0     NaN     NaN     NaN       B       B       B
Linha1     NaN     NaN     NaN       B       B       B
Linha2     NaN     NaN     NaN       B       B       B
linha0       C       C       C     NaN     NaN     NaN
linha1       C       C       C     NaN     NaN     NaN
linha2       C       C       C     NaN     NaN     NaN

In [105]:
df4 = pd.concat([df1, df2, df3], axis = 1)

In [106]:
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2 coluna0 coluna1 coluna2
linha0       A       A       A     NaN     NaN     NaN       C       C       C
linha1       A       A       A     NaN     NaN     NaN       C       C       C
linha2       A       A       A     NaN     NaN     NaN       C       C       C
Linha0     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN
Linha1     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN
Linha2     NaN     NaN     NaN       B       B       B     NaN     NaN     NaN